mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
/** @defgroup groupMSP430 MSP430
* MSP430 specific code
*/

/** @defgroup groupMSP430Pmm PMM
 *  @ingroup groupMSP430
* @brief functions for PMM(power management module) register access for TIs MSP430 -> Ti Driverlib equivalent naming
*
* @details
* Usage: \code {.cpp}

#include "MicroTrait/MT.hpp"

using namespace MT::MSP430;

 Pmm pmm{};
 pmm.unlockLPM5();

\endcode
*
* @author Steffen Fuchs
*<br> Email: admin@definefalsetrue.com
*<br> Web: https://definefalsetrue.com
*
****************************************************************
*/

/** @defgroup groupMSP430FRAMPmm FRAM specific
*  @ingroup groupMSP430Pmm
*  Functions for MSP430 FRAM Family
*/

/** @defgroup groupFuncsMSP430FRAMPmm Functions
*  @ingroup groupMSP430FRAMPmm
*  Functions in this module
*/

/** @defgroup groupEnumsMSP430FRAMPmm Enums
*  @ingroup groupMSP430FRAMPmm
*  Enums in this module
*/


/** @defgroup groupMSP430FPmm F5xx/6xx specific
*  @ingroup groupMSP430Pmm
*  Functions for MSP430F5xx/6xx Family
*/

/** @defgroup groupFuncsMSP430FPmm Functions
*  @ingroup groupMSP430FPmm
*  Functions in this module
*/

/** @defgroup groupEnumsMSP430FPmm Enums
*  @ingroup groupMSP430FPmm
*  Enums in this module
*/


/** @defgroup groupMSP430IPmm i2xx specific
*  @ingroup groupMSP430Pmm
*  Functions for MSP430i2xx Family
*/

/** @defgroup groupFuncsMSP430IPmm Functions
*  @ingroup groupMSP430IPmm
*  Functions in this module
*/

/** @defgroup groupEnumsMSP430IPmm Enums
*  @ingroup groupMSP430IPmm
*  Enums in this module
*/

#ifndef MICROTRAIT_MSP430_PMM_PMM_HPP_
#define MICROTRAIT_MSP430_PMM_PMM_HPP_

#include "MicroTrait/MSP430/Settings.hpp"
#include "MicroTrait/MSP430/Types.hpp"

#ifdef MT_USE_MSP430_LIB

#include "MicroTrait/Universal/Register.hpp"
#include <msp430.h>
#include <utility>
#include <type_traits>

#if defined(__MSP430_HAS_PMM__) || defined(__MSP430_HAS_PMM_FR5xx__) || defined(__MSP430_HAS_PMM_FRAM__)

#if defined(__MSP430_HAS_PMM_FRAM__) || defined(__MSP430_HAS_PMM_FR5xx__)
namespace MT::Misc {
#if defined(__MSP430_HAS_PMM_FRAM__)
enum class PMM_INT : uint16_t {
    BOR  = (PMMBORIFG),
    RST  = (PMMRSTIFG),
    POR  = (PMMPORIFG),
    SVSH = (SVSHIFG),
    LPM5 = (PMMLPM5IFG),
    ALL  = (0xA7)
};
template<>
struct enable_Enum_bits<PMM_INT> {
    static constexpr bool enable = true;
};

#elif defined(__MSP430_HAS_PMM_FR5xx__)
enum class PMM_INT : uint16_t {
    BOR  = (PMMBORIFG),
    RST  = (PMMRSTIFG),
    POR  = (PMMPORIFG),
    SVSH = (SVSHIFG),
    SVSL = (SVSLIFG),
    LPM5 = (PMMLPM5IFG),
    ALL  = (0xB7)
};
template<>
struct enable_Enum_bits<PMM_INT> {
    static constexpr bool enable = true;
};
#endif
}// namespace MT::Misc


namespace MT::MSP430::PMM {
/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief PMM interrupt types
****************************************************************
*/
using INT = MT::Misc::PMM_INT;

#if defined(__MSP430FR2XX_4XX_FAMILY__)
/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief Bandgap mode -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class BANDGAP_MODE : uint_fast8_t {
    STATIC = 0,
    SAMPLE
};

/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief Bandgap active or not -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class BANDGAP : uint_fast8_t {
    INACTIVE = 0,
    ACTIVE
};

/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief Reference generator active or not -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class REFGEN : uint_fast8_t {
    INACTIVE = 0,
    ACTIVE
};

/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief Bandgap status -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class BANDGAP_STATUS : uint_fast8_t {
    NOTREADY = 0,
    READY
};

/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief reference generator status -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class REFGEN_STATUS : uint_fast8_t {
    NOTREADY = 0,
    READY
};

#if defined(REFVSEL)
/**
* @ingroup groupEnumsMSP430FRAMPmm
****************************************************************
* @brief reference voltage selection -> only available for MSP430FR2xx/4xx Family
****************************************************************
*/
enum class REF_VOLT_SELECT : uint16_t {
    V1_5 = (REFVSEL_0),
    V2_0 = (REFVSEL_1),
    V2_5 = (REFVSEL_2)
};
#endif
#endif
}// namespace MT::MSP430::PMM

namespace MT::MSP430 {
struct Pmm {

  private:
    MT::Universal::Register<&PMMCTL0_L> m_ctl0{};
    MT::Universal::Register<&PMMCTL0_H> m_ctl0pwd{};
    MT::Universal::Register<&PMMCTL1>   m_ctl1{};
    MT::Universal::Register<&PMMCTL2>   m_ctl2{};
    MT::Universal::Register<&PMMIFG>    m_if{};
    MT::Universal::Register<&PM5CTL0>   m_lpm5{};

  public:
    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief enables the voltage supervisor high side -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVSH(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVSH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.set(SVSHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief disables the voltage supervisor high side -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVSH(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVSH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.clear(SVSHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Makes the LDO remain ON when going into LPM 3/4 -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.turnOnRegulator(); \endcode
	*
	****************************************************************
	*/
    constexpr void turnOnRegulator() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.clear(PMMREGOFF);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Turns off the LDO when going into LPM3/4, thus the system will enter LPM3.5 or LPM4.5 respectively -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.turnOffRegulator(); \endcode
	*
	****************************************************************
	*/
    constexpr void turnOffRegulator() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.set(PMMREGOFF);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief triggers a software Power On Reset (POR) -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.trigPOR(); \endcode
	*
	****************************************************************
	*/
    constexpr void trigPOR() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.set(PMMSWPOR);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief triggers a software Brown Out Rest (BOR) -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.trigBOR(); \endcode
	*
	****************************************************************
	*/
    constexpr void trigBOR() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.set(PMMSWBOR);
        m_ctl0pwd.override(0x00);
    }


    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief clears the interrupt flags for the given mask -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.clearInterrupt(PMM::INT::BOR | PMM::INT::POR); \endcode
	*@tparam BITS use enumeration PMM::INT
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    constexpr void clearInterrupt(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        m_ctl0pwd.override(PMMPW_H);
        m_if.clear(bit, bits...);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief compares the given pins with the interrupt flags set in the hw register -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.getInterruptStatus(PMM::INT::BOR | PMM::INT::POR) == INT_MASK_MATCH::TRUE) doSomething(); \endcode
	*@tparam BITS use enumeration PMM::INT
	*@return if all the given bits are set or not (INT_MASK_MATCH)
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    [[nodiscard]] constexpr INT_MASK_MATCH getInterruptStatus(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        if (m_if.compare(bit, bits...)) return INT_MASK_MATCH::TRUE;
        else
            return INT_MASK_MATCH::FALSE;
    }


    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Disable the GPIO power-on default high-impedance mode to activate previously configured port settings -> only available for MSP430 FRAM Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.unlockLPM5(); \endcode
	*
	****************************************************************
	*/
    constexpr void unlockLPM5() noexcept {
        m_lpm5.clear(LOCKLPM5);
    }

#if defined(__MSP430_HAS_PMM_FR5xx__)
    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief enables the voltage supervisor low side -> only available for MSP430FR5xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVSL(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVSL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.set(SVSLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief disables the voltage supervisor low side-> only available for MSP430FR5xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVSL(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVSL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl0.clear(SVSLE);
        m_ctl0pwd.override(0x00);
    }
#endif

#if defined(__MSP430FR2XX_4XX_FAMILY__)
    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief returns the bandgap mode of the PMM module -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.getBandgapMode() == PMM::BANDGAP_MODE::SAMPLE) doSomething(); \endcode
	*@return the curretn bandgap mode (PMM::BANDGAP_MODE)
	****************************************************************
	*/
    [[nodiscard]] constexpr PMM::BANDGAP_MODE getBandgapMode() noexcept {
        if (m_ctl2.compare(BGMODE)) return PMM::BANDGAP_MODE::SAMPLE;
        else
            return PMM::BANDGAP_MODE::STATIC;
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief returns the active status of the bandgap in the PMM module -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.isBandgapActive() == PMM::BANDGAP::ACTIVE) doSomething(); \endcode
	*@return if the bandgap is active or not (PMM::BANDGAP)
	****************************************************************
	*/
    [[nodiscard]] constexpr PMM::BANDGAP isBandgapActive() noexcept {
        if (m_ctl2.compare(REFBGACT)) return PMM::BANDGAP::ACTIVE;
        else
            return PMM::BANDGAP::INACTIVE;
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief the active status of the reference generator in the PMM module -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.isRefGenActive() == PMM::BANDGAP::ACTIVE) doSomething(); \endcode
	*@return if the reference generator is active or not (PMM::REFGEN)
	****************************************************************
	*/
    [[nodiscard]] constexpr PMM::REFGEN isRefGenActive() noexcept {
        if (m_ctl2.compare(REFGENACT)) return PMM::REFGEN::ACTIVE;
        else
            return PMM::REFGEN::INACTIVE;
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief returns the active status of the buffered bandgap voltage in the PMM -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.getBufferedBandgapVoltageStatus() == PMM::BANDGAP_STATUS::READY) doSomething(); \endcode
	*@return if the bandgap status is ready or not (PMM::BANDGAP_STATUS)
	****************************************************************
	*/
    [[nodiscard]] constexpr PMM::BANDGAP_STATUS getBufferedBandgapVoltageStatus() noexcept {
        if (m_ctl2.compare(REFBGRDY)) return PMM::BANDGAP_STATUS::READY;
        else
            return PMM::BANDGAP_STATUS::NOTREADY;
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief returns the status of the variable reference voltage in the PMM -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.getVariableReferenceVoltageStatus() == PMM::REFGEN_STATUS::READY) doSomething(); \endcode
	*@return if the variable reference status is ready or not(PMM::REFGEN_STATUS)
	****************************************************************
	*/
    [[nodiscard]] constexpr PMM::REFGEN_STATUS getVariableReferenceVoltageStatus() noexcept {
        if (m_ctl2.compare(REFGENRDY)) return PMM::REFGEN_STATUS::READY;
        else
            return PMM::REFGEN_STATUS::NOTREADY;
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Disables the internal temperature sensor to save power consumption -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableTempSensor(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableTempSensor() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl2.clear(TSENSOREN);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Enables the internal temperature sensor to save power consumption -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableTempSensor(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableTempSensor() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl2.set(TSENSOREN);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Disables the external reference output -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableExternalReference(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableExternalReference() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl2.clear(EXTREFEN);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Enables the external reference output -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableExternalReference(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableExternalReference() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl2.set(EXTREFEN);
        m_ctl0pwd.override(0x00);
    }


    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Disables the internal reference output -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableInternalReference(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableInternalReference() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ctl2.clear(INTREFEN);
        m_ctl0pwd.override(0x00);
    }

#if defined(REFVSEL)
    /**
	* @ingroup groupFuncsMSP430FRAMPmm
	****************************************************************
	* @brief Selects reference voltage level -> only available for MSP430FR2xx/4xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.selectVoltageReference(PMM::REF_VOLT_SELECT::V1_5); \endcode
	*
	****************************************************************
	*/
    constexpr void selectVoltageReference(const PMM::REF_VOLT_SELECT sel) noexcept {
        m_ctl2.clear(REFVSEL);
        typedef typename std::underlying_type<PMM::REF_VOLT_SELECT>::type underlying;
        m_ctl2.set(static_cast<underlying>(sel));
    }
#endif
#endif
};
}// namespace MT::MSP430


#elif defined(__MSP430_HAS_PMM__) && defined(__MSP430F5XX_6XX_FAMILY__)

namespace MT::Misc {
enum class PMM_INT : uint16_t {
    SVSM_LOWSIDE_DELY_EXP  = (SVSMLDLYIFG),
    SVM_LOWSIDE            = (SVMLIFG),
    SVM_LOWSIDE_REACHED    = (SVMLVLRIFG),
    SVSM_HIGHSIDE_DELY_EXP = (SVSMHDLYIFG),
    SVM_HIGHSIDE           = (SVMHIFG),
    SVM_HIGHSIDE_REACHED   = (SVMHVLRIFG),
    BOR                    = (PMMBORIFG),
    RST                    = (PMMRSTIFG),
    POR                    = (PMMPORIFG),
    SVS_HIGHSIDE           = (SVSHIFG),
    SVS_LOWSIDE            = (SVSLIFG),
    LPM5                   = (PMMLPM5IFG)
};
template<>
struct enable_Enum_bits<PMM_INT> {
    static constexpr bool enable = true;
};
