mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
}// namespace MT::Misc

namespace MT::MSP430::PMM {

/**
* @ingroup groupEnumsMSP430FPmm
****************************************************************
* @brief PMM interrupt types
****************************************************************
*/
using INT = MT::Misc::PMM_INT;

/**
* @ingroup groupEnumsMSP430FPmm
****************************************************************
* @brief core voltage selection -> only available for MSP430F5xx/6xx Family
****************************************************************
*/
enum class COREVOLT : uint16_t {
    LEVEL0 = (PMMCOREV_0),
    LEVEL1 = (PMMCOREV_1),
    LEVEL2 = (PMMCOREV_2),
    LEVEL3 = (PMMCOREV_3)
};
}// namespace MT::MSP430::PMM

namespace MT::MSP430 {
struct Pmm {

  private:
    MT::Universal::Register<&PMMCTL0_L> m_ctl0{};
    MT::Universal::Register<&PMMCTL0_H> m_ctl0pwd{};
    MT::Universal::Register<&PMMCTL1>   m_ctl1{};
    MT::Universal::Register<&PMMIFG>    m_if{};
    MT::Universal::Register<&PM5CTL0>   m_lpm5{};
    MT::Universal::Register<&SVSMHCTL>  m_svsmh{};
    MT::Universal::Register<&SVSMLCTL>  m_svsml{};
    MT::Universal::Register<&SVSMIO>    m_svsmio{};
    MT::Universal::Register<&PMMRIE>    m_ie{};

  public:
    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the voltage supervisor low side -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVSL(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVSL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the voltage supervisor low side -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVSL(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVSL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.clear(SVSLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the low-side SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVML(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVML() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVMLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the low-side SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVML(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVML() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.clear(SVMLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the voltage supervisor high side -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVSH(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVSH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVSHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the voltage supervisor high side -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVSH(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVSH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.clear(SVSHE);
        m_ctl0pwd.override(0x00);
    }


    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the high-side SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSVMH(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSVMH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVMHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the high-side SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSVMH(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSVMH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.clear(SVMHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the low-side SVS and SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsLSvmL(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsLSvmL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLE + SVMLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the low-side SVS and SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsLSvmL(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsLSvmL() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.clear(SVSLE + SVMLE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the high-side SVS and SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsHSvmH(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsHSvmH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVSHE + SVMHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the high-side SVS and SVM circuitry -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsHSvmH(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsHSvmH() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.clear(SVSHE + SVMHE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  enables the POR signal generation when a low-voltage event is registered by the low-side SVS -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsLReset(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsLReset() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.set(SVSLPE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  disables the POR signal generation when a low-voltage event is registered by the low-side SVS -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsLReset(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsLReset() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.clear(SVSLPE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the interrupt generation when a low-voltage event is registered by the low-side SVM -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvmLInterrupt(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvmLInterrupt() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.set(SVMLIE);
        m_ctl0pwd.override(0x00);
    }


    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the interrupt generation when a low-voltage event is registered by the low-side SVM -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvmLInterrupt(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvmLInterrupt() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.clear(SVMLIE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the POR signal generation when a low-voltage event is registered by the high-side SVS -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsHReset(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsHReset() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.set(SVSHPE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the POR signal generation when a low-voltage event is registered by the high-side SVS -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsHReset(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsHReset() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.clear(SVSHPE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief enables the interrupt generation when a low-voltage event is registered by the high-side SVM -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvmHInterrupt(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvmHInterrupt() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.set(SVMHIE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables the interrupt generation when a low-voltage event is registered by the high-side SVM -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvmHInterrupt(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvmHInterrupt() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_ie.clear(SVMHIE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief clear all interrupt flags for the PMM
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.clearPMMIFGS(); \endcode
	*
	****************************************************************
	*/
    constexpr void clearPMMIFGS() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_if.override(0);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  enables supervisor low side in LPM with twake-up-fast from LPM2, LPM3, and LPM4 -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsLInLPMFastWake(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsLInLPMFastWake() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLFP + SVSLMD);
        m_svsml.clear(SVSMLACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  enables supervisor low side in LPM with twake-up-slow from LPM2, LPM3, and LPM4 -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsLInLPMSlowWake(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsLInLPMSlowWake() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLMD);
        m_svsml.clear(SVSLFP + SVSMLACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  disables supervisor low side in LPM with twake-up-fast from LPM2, LPM3, and LPM4 -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsLInLPMFastWake(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsLInLPMFastWake() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLFP);
        m_svsml.clear(SVSLMD + SVSMLACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  disables supervisor low side in LPM with twake-up-slow from LPM2, LPM3, and LPM4 -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsLInLPMSlowWake(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsLInLPMSlowWake() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.clear(SVSLFP + SVSMLACE + SVSLMD);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  Enables supervisor high side in LPM with tpd = 20 s -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsHInLPMNormPerf(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsHInLPMNormPerf() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVSHMD);
        m_svsmh.clear(SVSMHACE + SVSHFP);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief  Enables supervisor high side in LPM with tpd = 2.5 s -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableSvsHInLPMFullPerf(); \endcode
	*
	****************************************************************
	*/
    constexpr void enableSvsHInLPMFullPerf() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVSHMD + SVSHFP);
        m_svsmh.clear(SVSMHACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables supervisor high side in LPM with tpd = 20 s -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsHInLPMNormPerf(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsHInLPMNormPerf() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.clear(SVSMHACE + SVSHFP + SVSHMD);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief disables supervisor high side in LPM with tpd = 2.5 s -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableSvsHInLPMFullPerf(); \endcode
	*
	****************************************************************
	*/
    constexpr void disableSvsHInLPMFullPerf() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsmh.set(SVSHFP);
        m_svsmh.clear(SVSMHACE + SVSHMD);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief optimized to provide twake-up-fast from LPM2, LPM3, and LPM4 with least power -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.optimizeSvsLInLPMFastWake(); \endcode
	*
	****************************************************************
	*/
    constexpr void optimizeSvsLInLPMFastWake() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSLFP + SVSLMD + SVSMLACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief optimized to provide tpd = 2.5 s in LPM with least power -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.optimizeSvsHInLPMFullPerf (); \endcode
	*
	****************************************************************
	*/
    constexpr void optimizeSvsHInLPMFullPerf() noexcept {
        m_ctl0pwd.override(PMMPW_H);
        m_svsml.set(SVSHMD + SVSHFP + SVSMHACE);
        m_ctl0pwd.override(0x00);
    }

    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief Decrease Vcore by one level -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.setVCoreDown(PMM::COREVOLT::LEVEL0) == STATUS::FAIL) doSomething(); \endcode
	*@param lev level to which Vcore needs to be decreased (PMM::COREVOLT)
	*@return the status of the cmoannd execution(STATUS)
	****************************************************************
	*/
    [[nodiscard]] constexpr STATUS setVCoreDown(PMM::COREVOLT lev) noexcept {

