mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
        //Get actual VCore
        uint16_t actlevel = (m_ctl0.get() & PMMCOREV_3);

        //Disable interrupts because certain peripherals will not
        //work during VCORE change
        const uint16_t interruptState = __get_interrupt_state();
        __disable_interrupt();
        __no_operation();

        //step by step increase or decrease
        while ((level != actlevel) && (status == STATUS::SUCCESS)) {
            if (level > actlevel) {
                status = setVCoreUp(static_cast<PMM::COREVOLT>(++actlevel));
            } else {
                status = setVCoreDown(static_cast<PMM::COREVOLT>(--actlevel));
            }
        }

        //Re-enable interrupt state to whatever it was before
        if (interruptState & GIE) {
            __enable_interrupt();
        }

        return status;
    }


    /**
	* @ingroup groupFuncsMSP430FPmm
	****************************************************************
	* @brief compares the given pins with the interrupt flags set in the hw register -> only available for MSP430F5xx/6xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  if(pmm.getInterruptStatus(PMM::INT::BOR | PMM::INT::POR) == INT_MASK_MATCH::TRUE) doSomething(); \endcode
	*@tparam BITS use enumeration PMM::INT
	*@return if all the given bits are set or not (INT_MASK_MATCH)
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    [[nodiscard]] constexpr INT_MASK_MATCH getInterruptStatus(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        if (m_if.compare(bit, bits...)) return INT_MASK_MATCH::TRUE;
        else
            return INT_MASK_MATCH::FALSE;
    }
};
}// namespace MT::MSP430

#elif defined(__MSP430_HAS_PMM__) && defined(__MSP430_HAS_MSP430I_CPU__)

namespace MT::Misc {
enum class PMM_INT : uint16_t {
    VMON  = (VMONIE),
    LPM45 = (LPM45IFG)
};
template<>
struct enable_Enum_bits<PMM_INT> {
    static constexpr bool enable = true;
};
}// namespace MT::Misc


namespace MT::MSP430::PMM {

/**
* @ingroup groupEnumsMSP430IPmm
****************************************************************
* @brief PMM interrupt types
****************************************************************
*/
using INT = MT::Misc::PMM_INT;

/**
* @ingroup groupEnumsMSP430IPmm
****************************************************************
* @brief voltage monitor -> only available for MSP430i2xx Family
****************************************************************
*/
enum class VOLT_MONITOR : uint16_t {
    DISABLE       = (VMONLVL_0),
    DVCC_2350MV   = (VMONLVL_1),
    DVCC_2650MV   = (VMONLVL_2),
    DVCC_2850MV   = (VMONLVL_3),
    VMONIN_1160MV = (VMONLVL_7)
};

/**
* @ingroup groupEnumsMSP430IPmm
****************************************************************
* @brief voltage monitor -> only available for MSP430i2xx Family
****************************************************************
*/
enum class REGULATOR : uint8_t {
    ON  = (0x00),
    OFF = (0x10)
};
}// namespace MT::MSP430::PMM

namespace MT::MSP430 {

struct Pmm {

  private:
    MT::Universal::Register<&LPM45CTL> m_lpm45{};
    MT::Universal::Register<&VMONCTL>  m_vmon{};
    MT::Universal::Register<&REFCAL0>  m_rcal0{};
    MT::Universal::Register<&REFCAL1>  m_rcal1{};

  public:
    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief sets up the voltage monitor -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.setupVoltageMonitor(PMM::VOLT_MONITOR::DVCC_2350MV); \endcode
	*@param mon new voltage monitor level
	****************************************************************
	*/
    constexpr void setupVoltageMonitor(const PMM::VOLT_MONITOR mon) noexcept {
        uint8_t currentStatus = m_vmon.get();
        currentStatus &= ~(0x07);
        currentStatus |= static_cast<uint8_t>(mon);
        m_vmon.override(currentStatus);
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  sets up the calibration of the internal reference -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.calibrateReference(); \endcode
	*
	****************************************************************
	*/
    constexpr void calibrateReference() noexcept {
        m_rcal0.override(TLV_START + TLV_CAL_REFCAL0);
        m_rcal1.override(TLV_START + TLV_CAL_REFCAL1);
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief sets the status of the PMM regulator -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.setRegulatorStatus(PMM::REGULATOR::ON); \endcode
	*@param reg regulator on or off
	****************************************************************
	*/
    constexpr void setRegulatorStatus(const PMM::REGULATOR reg) noexcept {
        uint8_t currentStatus = m_lpm45.get();
        currentStatus &= ~(PMMREGOFF);
        currentStatus |= static_cast<uint8_t>(reg);
        m_lpm45.override(currentStatus);
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  unlocks the IO -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.unlockIOConfiguration(); \endcode
	*
	****************************************************************
	*/
    constexpr void unlockIOConfiguration() noexcept {
        m_lpm45.clear(LOCKLPM45);
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  enables interrupts -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.enableInterrupt(PMM::INT::LPM45); \endcode
	*
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    constexpr void enableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        m_vmon.set(bit, bits...);
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  disables interrupts -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
	*@tparam BITS use enumeration PMM::INT
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    constexpr void disableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        m_vmon.clear(bit, bits...);
    }


    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  disables interrupts -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
	*@tparam BITS use enumeration PMM::INT
	*@return if all the given bits are set or not (INT_MASK_MATCH)
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    constexpr INT_MASK_MATCH disableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");

        const BIT     sum  = MT::Details::orSum(bit, bits...);
        const uint8_t mask = static_cast<uint8_t>(sum);

        if ((mask & VMONIE) && (VMONCTL & VMONIFG)) return INT_MASK_MATCH::TRUE;
        else if (mask & LPM45IFG)
            return INT_MASK_MATCH::TRUE;

        return INT_MASK_MATCH::FALSE;
    }

    /**
	* @ingroup groupFuncsMSP430IPmm
	****************************************************************
	* @brief  disables interrupts -> only available for MSP430i2xx Family
	* @details
	* Usage: \code {.cpp}
	* using namespace MT::MSP430;
	*
	*  Pmm pmm{};
	*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
	*@tparam BITS use enumeration PMM::INT
	****************************************************************
	*/
    template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
    constexpr void clearInterrupt(const BIT &bit, const BITS &... bits) noexcept {
        static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
        const BIT     sum  = MT::Details::orSum(bit, bits...);
        const uint8_t mask = static_cast<uint8_t>(sum);
        m_lpm45.clear(mask);
    }
};
}// namespace MT::MSP430

#endif
#endif
#endif
#endif /* MICROTRAIT_MSP430_PMM_PMM_HPP_ */
